const numbers = [5, 8, -1, '-6', 11, 'ololo', '-2']
let sum = 0
// for (let i = 0; i < numbers.length; i++) {
//   sum += numbers[i]
// }
// alert('Sum is ' + sum)

// 1) Оголосили numbers
// 2) Присвоїли numbers масив з 7 елементів 5, 8, -1, '-6', 11, 'ololo', '-2': numbers = [5, 8, -1, '-6', 11, 'ololo', '-2']
// 3) Оголосили sum
// 4) Присвоїли sum 0: sum = 0
// 5) оголосити i
// 6) присвоїти i 0: i = 0
// 7) перевірити, чи i менше довжини масиву: 0 < 7 - так
// 8) присвоїти sum попереднє значення додане на 0-й елемент масиву: sum = 0 + 5 = 5
// 9) збільшити i на одиницю: i = 1
// 10) перевірити, чи i менше довжини масиву: 1 < 7 - так
// 11) присвоїти sum попереднє значення додане на 1-й елемент масиву: sum = 5 + 8 = 13
// 12) збільшити i на одиницю: i = 2
// 13) перевірити, чи i менше довжини масиву: 2 < 7 - так
// 14) присвоїти sum попереднє значення додане на 2-й елемент масиву: sum = 13 + -1 = 12
// 15) збільшити i на одиницю: i = 3
// 16) перевірити, чи i менше довжини масиву: 3 < 7 - так
// 17) присвоїти sum попереднє значення додане на 3-й елемент масиву: sum = 12 + "-6" = 12-6 (Error)

// Щоб пофіксити баг треба додати валідацію на число: 

for (let i = 0; i < numbers.length; i++) {
  const currentNumber = parseFloat(numbers[i])
  if (!isNaN(currentNumber)) {
    sum += currentNumber
  }
}

alert('Sum is ' + sum)
